In [3]:
import pandas as pd
import numpy as np
import  matplotlib.pyplot as plt
import seaborn as sns
import re

In [4]:
air_pollutions_df = pd.read_excel('../data/national_state_sector_2002_2024_caps_21feb2025_tons (1).xlsx', sheet_name='State')

In [5]:
air_pollutions_df.head(2)

,State FIPS,State,Pollutant,Sector,emissions2002,emissions2003,emissions2004,emissions2005,emissions2006,emissions2007,...,emissions2015,emissions2016,emissions2017,emissions2018,emissions2019,emissions2020,emissions2021,emissions2022,emissions2023,emissions2024
0,1,AL,Black Carbon,Agriculture - Crops & Livestock Dust,186.911689,192.755284,184.744382,181.600073,176.485625,176.472545,...,165.032132,171.476645,177.730086,182.751299,180.776253,179.027200,179.027234,173.883152,173.883152,173.883152
1,1,AL,Black Carbon,Fuel & Services - Gasoline Terminals,0.007700,0.007700,0.007700,0.007700,0.007700,0.007700,...,0.007700,0.007700,0.007700,0.007700,0.007700,0.007511,0.007082,0.006873,0.006873,0.006873

In [9]:
air_pollutions_df[['Sector', 'Category', 'Subcategory']] = (
    air_pollutions_df['Sector']
    .str
    .split('-', n=2, expand=True)
)

In [10]:
air_pollutions_df.head()

,State FIPS,State,Pollutant,Sector,emissions2002,emissions2003,emissions2004,emissions2005,emissions2006,emissions2007,...,emissions2017,emissions2018,emissions2019,emissions2020,emissions2021,emissions2022,emissions2023,emissions2024,Category,Subcategory
0,1,AL,Black Carbon,Agriculture,186.911689,192.755284,184.744382,181.600073,176.485625,176.472545,...,177.730086,182.751299,180.776253,179.027200,179.027234,173.883152,173.883152,173.883152,Crops & Livestock Dust,None
1,1,AL,Black Carbon,Fuel & Services,0.007700,0.007700,0.007700,0.007700,0.007700,0.007700,...,0.007700,0.007700,0.007700,0.007511,0.007082,0.006873,0.006873,0.006873,Gasoline Terminals,None
2,1,AL,Black Carbon,Fuel & Services,38.416900,38.416900,38.416900,38.416900,38.093000,38.093000,...,39.815800,39.815800,39.815800,92.172021,92.088614,92.088614,92.088614,92.088614,Commercial Cooking,None
3,1,AL,Black Carbon,Dust,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,Construction Dust,None
4,1,AL,Black Carbon,Dust,49.204652,45.977755,50.477153,53.880845,50.906936,67.234186,...,64.094491,57.509753,65.910076,53.003271,42.214994,49.981178,49.981178,49.981178,Paved Road Dust,None

In [11]:
air_pollutions_df['Category'].unique()

array([' Crops & Livestock Dust', ' Gasoline Terminals',
       ' Commercial Cooking', ' Construction Dust', ' Paved Road Dust',
       ' Unpaved Road Dust', ' Agricultural Field Burning',
       ' Prescribed Fires', ' Wildfires', ' Comm/Institutional ',
       ' Electric Generation ', ' Industrial Boilers ', ' Residential ',
       ' Gas Stations', ' Cement Manufacturing',
       ' Chemical Manufacturing', ' Iron & Steel Industry', ' Mining',
       ' Other Industrial Processes', ' Aluminum & Other Metals',
       ' Oil & Gas Production', ' Petroleum Refineries', ' Pulp & Paper',
       ' Storage and Transfer', None, ' Aircraft', ' Marine Transport',
       ' Rail Transport', ' Off Road Equipment ', ' On Road Vehicles ',
       ' Degreasing', ' Dry Cleaning', ' Graphic Arts',
       ' Industrial Coating & Solvent Use', ' Fertilizer Application',
       ' Livestock Waste', ' Consumer & Commercial Solvent Use', ' Non'],
      dtype=object)

In [12]:
air_pollutions_df['State'].unique()

array(['AL', 'AK', 'AZ', 'AR', 'CA', 'CO', 'CT', 'DE', 'DC', 'FL', 'GA',
       'HI', 'ID', 'IL', 'IN', 'IA', 'KS', 'KY', 'LA', 'ME', 'MD', 'MA',
       'MI', 'MN', 'MS', 'MO', 'MT', 'NE', 'NV', 'NH', 'NJ', 'NM', 'NY',
       'NC', 'ND', 'OH', 'OK', 'OR', 'PA', 'RI', 'SC', 'SD', 'TN', 'TX',
       'UT', 'VT', 'VA', 'WA', 'WV', 'WI', 'WY', 'PR', 'VI', 'TB'],
      dtype=object)

In [15]:
states_df = pd.read_csv('../data/states_boundries_updated.csv')
states_df.head()
df_states= states_df.rename(columns={'STUSPS' : 'State'})
#df_states.head()

In [16]:
merged_df = pd.merge(air_pollutions_df, df_states, on='State', how='inner' )
merged_df.shape

(24379, 33)

In [17]:
airpollution_df = merged_df[['State', 'NAME', 'Pollutant', 'Sector','Category', 'Subcategory', 'emissions2002', 'emissions2003', 'emissions2004', 'emissions2005','emissions2006','emissions2007',
          'emissions2008', 'emissions2009','emissions2010','emissions2011','emissions2012','emissions2013','emissions2014','emissions2015','emissions2016',
          'emissions2017','emissions2018','emissions2019','emissions2020','emissions2021','emissions2022', 'emissions2023', 'emissions2024','INTPTLAT','INTPTLON']]

In [18]:
airpollution_df.head()

,State,NAME,Pollutant,Sector,Category,Subcategory,emissions2002,emissions2003,emissions2004,emissions2005,...,emissions2017,emissions2018,emissions2019,emissions2020,emissions2021,emissions2022,emissions2023,emissions2024,INTPTLAT,INTPTLON
0,AL,Alabama,Black Carbon,Agriculture,Crops & Livestock Dust,None,186.911689,192.755284,184.744382,181.600073,...,177.730086,182.751299,180.776253,179.027200,179.027234,173.883152,173.883152,173.883152,32.739579,-86.843447
1,AL,Alabama,Black Carbon,Fuel & Services,Gasoline Terminals,None,0.007700,0.007700,0.007700,0.007700,...,0.007700,0.007700,0.007700,0.007511,0.007082,0.006873,0.006873,0.006873,32.739579,-86.843447
2,AL,Alabama,Black Carbon,Fuel & Services,Commercial Cooking,None,38.416900,38.416900,38.416900,38.416900,...,39.815800,39.815800,39.815800,92.172021,92.088614,92.088614,92.088614,92.088614,32.739579,-86.843447
3,AL,Alabama,Black Carbon,Dust,Construction Dust,None,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,32.739579,-86.843447
4,AL,Alabama,Black Carbon,Dust,Paved Road Dust,None,49.204652,45.977755,50.477153,53.880845,...,64.094491,57.509753,65.910076,53.003271,42.214994,49.981178,49.981178,49.981178,32.739579,-86.843447

In [19]:
#df.columns = df.columns.str.replace('emissions', '')
airpollution_df.columns = airpollution_df.columns.str.replace('emissions', '')

In [20]:
new_df = airpollution_df.copy()
new_df.head()
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24379 entries, 0 to 24378
Data columns (total 31 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   State        24379 non-null  object
 1   NAME         24379 non-null  object
 2   Pollutant    24379 non-null  object
 3   Sector       24379 non-null  object
 4   Category     23425 non-null  object
 5   Subcategory  12232 non-null  object
 6   2002         24375 non-null  float64
 7   2003         24375 non-null  float64
 8   2004         24375 non-null  float64
 9   2005         24375 non-null  float64
 10  2006         24375 non-null  float64
 11  2007         24375 non-null  float64
 12  2008         24375 non-null  float64
 13  2009         24375 non-null  float64
 14  2010         24375 non-null  float64
 15  2011         24375 non-null  float64
 16  2012         24375 non-null  float64
 17  2013         24375 non-null  float64
 18  2014         24375 non-null  float64
 19  2015         24375 non-null  float64
 20  2016         24375 non-null  float64
 21  2017         24375 non-null  float64
 22  2018         24375 non-null  float64
 23  2019         24375 non-null  float64
 24  2020         22073 non-null  float64
 25  2021         24375 non-null  float64
 26  2022         24375 non-null  float64
 27  2023         24375 non-null  float64
 28  2024         24375 non-null  float64
 29  INTPTLAT     24379 non-null  float64
 30  INTPTLON     24379 non-null  float64
dtypes: float64(25), object(6)
memory usage: 5.8+ MB

In [21]:
df_melted_new =(
    new_df
    .melt(id_vars = ['State','NAME','Pollutant','Sector','Category','Subcategory','INTPTLAT', 'INTPTLON'], var_name='Year', value_name='Value')
)

### Data preparation for question 1 and 2

In [22]:
pollution_df= df_melted_new.copy()
pollution_df['Value'] = pollution_df['Value'].fillna(0)
#df['value'] = df['value'].fillna(0)
print(pollution_df.info())
pollution_df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 560717 entries, 0 to 560716
Data columns (total 10 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   State        560717 non-null  object
 1   NAME         560717 non-null  object
 2   Pollutant    560717 non-null  object
 3   Sector       560717 non-null  object
 4   Category     538775 non-null  object
 5   Subcategory  281336 non-null  object
 6   INTPTLAT     560717 non-null  float64
 7   INTPTLON     560717 non-null  float64
 8   Year         560717 non-null  object
 9   Value        560717 non-null  float64
dtypes: float64(3), object(7)
memory usage: 42.8+ MB
None

,State,NAME,Pollutant,Sector,Category,Subcategory,INTPTLAT,INTPTLON,Year,Value
0,AL,Alabama,Black Carbon,Agriculture,Crops & Livestock Dust,None,32.739579,-86.843447,2002,186.911689
1,AL,Alabama,Black Carbon,Fuel & Services,Gasoline Terminals,None,32.739579,-86.843447,2002,0.007700
2,AL,Alabama,Black Carbon,Fuel & Services,Commercial Cooking,None,32.739579,-86.843447,2002,38.416900
3,AL,Alabama,Black Carbon,Dust,Construction Dust,None,32.739579,-86.843447,2002,0.000000
4,AL,Alabama,Black Carbon,Dust,Paved Road Dust,None,32.739579,-86.843447,2002,49.204652

### Data preparation for qiestion 3

In [23]:
Biomass_df= pd.read_excel('../data/use_renew_source.xlsx', sheet_name= 'Biomass' )
biomass_melted = (
    Biomass_df
    .melt(
    id_vars='State',
    var_name='Year',
    value_name='Value'
))
date_filtered_biomass = biomass_melted[biomass_melted['Year'].between(2002, 2024)]
date_filtered_biomass.head()

     State  Year   Value
2184    AK  2002    3529
2185    AL  2002  163687
2186    AR  2002   72970
2187    AZ  2002    9306
2188    CA  2002  171500

In [24]:
geothermal_df= pd.read_excel('../data/use_renew_source.xlsx', sheet_name= 'Geothermal' )
geothermal_melted = (
    geothermal_df
    .melt(
    id_vars='State',
    var_name='Year',
    value_name='geo_Value'
))
date_filtered_geo = geothermal_melted[biomass_melted['Year'].between(2002, 2024)]
date_filtered_geo.head()

     State  Year  geo_Value
2184    AK  2002         86
2185    AL  2002         67
2186    AR  2002        228
2187    AZ  2002        294
2188    CA  2002      46830

In [25]:
hydro_df= pd.read_excel('../data/use_renew_source.xlsx', sheet_name= 'Hydropower' )
hydro_melted = (
    hydro_df
    .melt(
    id_vars='State',
    var_name='Year',
    value_name='hydro_Value'
))
date_filtered_hydro = hydro_melted[hydro_melted['Year'].between(2002, 2024)]
date_filtered_hydro.head()
print(date_filtered_hydro.info())

<class 'pandas.core.frame.DataFrame'>
Index: 1144 entries, 2184 to 3327
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   State        1144 non-null   object
 1   Year         1144 non-null   object
 2   hydro_Value  1144 non-null   int64
dtypes: int64(1), object(2)
memory usage: 35.8+ KB
None

In [26]:
solar_df= pd.read_excel('../data/use_renew_source.xlsx', sheet_name= 'Solar energy' )
solar_melted = (
    solar_df
    .melt(
    id_vars='State',
    var_name='Year',
    value_name='solar_Value'
))
date_filtered_solar = solar_melted[solar_melted['Year'].between(2002, 2024)]
date_filtered_solar.head()

     State  Year  solar_Value
2184    AK  2002            0
2185    AL  2002           82
2186    AR  2002          500
2187    AZ  2002         2865
2188    CA  2002        17815

In [27]:
wind_df= pd.read_excel('../data/use_renew_source.xlsx', sheet_name= 'Wind energy' )
wind_melted = (
    wind_df
    .melt(
    id_vars='State',
    var_name='Year',
    value_name='wind_Value'
))
date_filtered_wind = wind_melted[wind_melted['Year'].between(2002, 2024)]
date_filtered_wind.head()

     State  Year  wind_Value
2184    AK  2002           0
2185    AL  2002           0
2186    AR  2002           0
2187    AZ  2002           0
2188    CA  2002       12975

#### concat all renewable energy

In [28]:
solar = date_filtered_solar.rename(columns={'solar_Value':'value'})
wind = date_filtered_wind.rename(columns={'wind_Value':'value'})
geothermal = date_filtered_geo.rename(columns={'geo_Value':'value'})
hydro = date_filtered_hydro.rename(columns={'hydro_Value':'value'})
biomass = date_filtered_biomass.rename(columns={'Value':'value'})

In [29]:
solar['Energy'] = 'Solar'
wind['Energy'] = 'Wind'
geothermal['Energy'] = 'Geothermal'
hydro['Energy'] = 'Hydro'
biomass['Energy'] = 'Biomass'

In [30]:
solar.head()

     State  Year  value Energy
2184    AK  2002      0  Solar
2185    AL  2002     82  Solar
2186    AR  2002    500  Solar
2187    AZ  2002   2865  Solar
2188    CA  2002  17815  Solar

In [31]:
concat_df = pd.concat([solar, wind, geothermal, hydro, biomass])
renew_energy = concat_df[['State', 'Year', 'Energy', 'value']]
print(renew_energy.head())
print("*******************************")
print(renew_energy.info())

     State  Year Energy  value
2184    AK  2002  Solar      0
2185    AL  2002  Solar     82
2186    AR  2002  Solar    500
2187    AZ  2002  Solar   2865
2188    CA  2002  Solar  17815
*******************************
<class 'pandas.core.frame.DataFrame'>
Index: 5720 entries, 2184 to 3327
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   State   5720 non-null   object
 1   Year    5720 non-null   object
 2   Energy  5720 non-null   object
 3   value   5720 non-null   int64
dtypes: int64(1), object(3)
memory usage: 223.4+ KB
None

In [32]:
states = df_states[['State', 'NAME', 'INTPTLAT', 'INTPTLON']]

In [33]:
renew_energy_poly = pd.merge(renew_energy, states, on='State', how='inner' )
renew_energy_poly.head()

  State  Year Energy  value        NAME   INTPTLAT    INTPTLON
0    AK  2002  Solar      0      Alaska  63.347356 -152.839733
1    AL  2002  Solar     82     Alabama  32.739579  -86.843447
2    AR  2002  Solar    500    Arkansas  34.895526  -92.444626
3    AZ  2002  Solar   2865     Arizona  34.203936 -111.606345
4    CA  2002  Solar  17815  California  37.155177 -119.543418

In [34]:
pollution_group= pollution_df.groupby(['State', 'Year'])['Value'].sum().reset_index(name='emission_value')
pollution_group['emission_value_mlns'] = pollution_group['emission_value']/1000000
pollution_by_year = pollution_group[['State', 'Year', 'emission_value_mlns']]
print(pollution_by_year.head())
pollution_by_year['Year'] = pollution_by_year['Year'].astype(int)
energy_df = renew_energy.groupby(['State', 'Year'])['value'].sum().reset_index(name='energy_value')
energy_by_year = energy_df[['State','Year', 'energy_value']]
emission_energy= pd.merge(pollution_by_year, energy_by_year, on=['State', 'Year'], how='inner' )
print(emission_energy.head())
print(emission_energy.info())

  State  Year  emission_value_mlns
0    AK  2002             2.143011
1    AK  2003             1.410754
2    AK  2004             4.918640
3    AK  2005             3.510408
4    AK  2006             1.035269
  State  Year  emission_value_mlns  energy_value
0    AK  2002             2.143011          8526
1    AK  2003             1.410754          8974
2    AK  2004             4.918640          8964
3    AK  2005             3.510408          6220
4    AK  2006             1.035269          5330
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1122 entries, 0 to 1121
Data columns (total 4 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   State                1122 non-null   object
 1   Year                 1122 non-null   int64
 2   emission_value_mlns  1122 non-null   float64
 3   energy_value         1122 non-null   int64
dtypes: float64(1), int64(2), object(1)
memory usage: 35.2+ KB
None

C:\Users\jinor\AppData\Local\Temp\ipykernel_116992\482436481.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  pollution_by_year['Year'] = pollution_by_year['Year'].astype(int)

In [35]:
emission_energy_poly = pd.merge(emission_energy, states, on='State', how='inner' )
emission_energy_poly.head()

,State,Year,emission_value_mlns,energy_value,NAME,INTPTLAT,INTPTLON
0,AK,2002,2.143011,8526,Alaska,63.347356,-152.839733
1,AK,2003,1.410754,8974,Alaska,63.347356,-152.839733
2,AK,2004,4.918640,8964,Alaska,63.347356,-152.839733
3,AK,2005,3.510408,6220,Alaska,63.347356,-152.839733
4,AK,2006,1.035269,5330,Alaska,63.347356,-152.839733

### Data preparation for Question 4

In [36]:
motor_vehicle_df = pd.read_csv('../data/Motor_Vehicle_Registrations__1900_-_2023__MV-1_.csv')
motor_vehicle = motor_vehicle_df.rename(columns={'State': 'NAME'})
motor_vehicle.head()

   Year     NAME    Category Type  Vehicles
0  1900  Alabama        Auto  NaN      40.0
1  1900  Alabama         Bus  NaN       0.0
2  1900  Alabama       Truck  NaN       0.0
3  1900  Alabama  Motorcycle  NaN       0.0
4  1900   Alaska        Auto  NaN       0.0

In [37]:
Years_filtered = motor_vehicle[motor_vehicle['Year'].between(2002, 2025)]
Years_filtered.head()

       Year     NAME Category     Type   Vehicles
21232  2002  Alabama     Auto  Private  1785645.0
21233  2002  Alabama     Auto   Public    16033.0
21234  2002  Alabama      Bus  Private     2523.0
21235  2002  Alabama      Bus   Public     6371.0
21236  2002  Alabama    Truck  Private  2590390.0

In [38]:
merged_state_vehicle = pd.merge(Years_filtered, df_states[['State', 'NAME']], on='NAME', how='left')
merged_state_vehicle.head()

   Year     NAME Category     Type   Vehicles State
0  2002  Alabama     Auto  Private  1785645.0    AL
1  2002  Alabama     Auto   Public    16033.0    AL
2  2002  Alabama      Bus  Private     2523.0    AL
3  2002  Alabama      Bus   Public     6371.0    AL
4  2002  Alabama    Truck  Private  2590390.0    AL

In [39]:
merged_vehicle_cleaned = merged_state_vehicle.copy()
merged_vehicle_cleaned = merged_vehicle_cleaned[['Year', 'State', 'Vehicles']]
vehicle_by_year = merged_vehicle_cleaned.groupby(['State', 'Year'])['Vehicles'].sum().reset_index(name='total_vehicles')
emission_vehicle_df = pd.merge(pollution_by_year, vehicle_by_year, on=['State', 'Year'], how='inner' )
print(emission_vehicle_df.head())
print(emission_vehicle_df.info())

  State  Year  emission_value_mlns  total_vehicles
0    AK  2002             2.143011        638588.0
1    AK  2003             1.410754        656398.0
2    AK  2004             4.918640        681115.0
3    AK  2005             3.510408        694996.0
4    AK  2006             1.035269        699216.0
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1131 entries, 0 to 1130
Data columns (total 4 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   State                1131 non-null   object
 1   Year                 1131 non-null   int64
 2   emission_value_mlns  1131 non-null   float64
 3   total_vehicles       1131 non-null   float64
dtypes: float64(2), int64(1), object(1)
memory usage: 35.5+ KB
None